---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.FluidType
source: html/6de7a895-6747-7273-55cf-19f917a30c84.htm
---
# Autodesk.Revit.DB.Plumbing.FluidType

Has been extended to provide read and write access to a collection of FluidTemperature objects which represent the fluid's properties at various temperatures.

## Syntax (C#)
```csharp
public class FluidType : ElementType, IEnumerable<FluidTemperature>
```